In [131]:
import pandas as pd

In [132]:
pd.__version__

'2.0.1'

In [133]:
my_details={
    'name':['Uday Vikram Singh','Anubhav Yadav','Prakhar Nigam','Anand Kumar','Ravi Mishra'],
    'age':[20,21,21,23,21],
    'Degree':['B.Tech(CSE)','B.Tech(Chemical)','B.Tech(Cyber Security)','B.Arch','Nursing'],
    'College':['SRMCEM','IET','Chandigarh University','SDCA',None],
    'Location':['Lucknow','Lucknow','Chandigarh','Ghaziabad','Lucknow'],
}

In [134]:
print(my_details)

{'name': ['Uday Vikram Singh', 'Anubhav Yadav', 'Prakhar Nigam', 'Anand Kumar', 'Ravi Mishra'], 'age': [20, 21, 21, 23, 21], 'Degree': ['B.Tech(CSE)', 'B.Tech(Chemical)', 'B.Tech(Cyber Security)', 'B.Arch', 'Nursing'], 'College': ['SRMCEM', 'IET', 'Chandigarh University', 'SDCA', None], 'Location': ['Lucknow', 'Lucknow', 'Chandigarh', 'Ghaziabad', 'Lucknow']}

In [135]:
my_df=pd.DataFrame(my_details,index=('A','B','C','D','E'))
print(my_df)

                name  age                  Degree                College
A  Uday Vikram Singh   20             B.Tech(CSE)                 SRMCEM  \
B      Anubhav Yadav   21        B.Tech(Chemical)                    IET
C      Prakhar Nigam   21  B.Tech(Cyber Security)  Chandigarh University
D        Anand Kumar   23                  B.Arch                   SDCA
E        Ravi Mishra   21                 Nursing                   None

     Location
A     Lucknow
B     Lucknow
C  Chandigarh
D   Ghaziabad
E     Lucknow

# Data Access

In [136]:
my_df.head() # first five rows

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [137]:
my_df.tail() # last five columns

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [138]:
my_df.index # it is a series of labels that identify each row, used for label-based access and alignments

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [139]:
my_df

,name,age,Degree,College,Location
A,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
B,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
C,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
D,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
E,Ravi Mishra,21,Nursing,None,Lucknow

In [140]:
my_df.index=['a','b','c','d','e']

In [141]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,None,Lucknow

In [142]:
# accessing information using index
my_df.loc['e']

name        Ravi Mishra
age                  21
Degree          Nursing
College            None
Location        Lucknow
Name: e, dtype: object

# Data Cleaning

In [143]:
my_df.isnull() # used for checking missing values, checks whether value is null or not, True on e's college

    name    age  Degree  College  Location
a  False  False   False    False     False
b  False  False   False    False     False
c  False  False   False    False     False
d  False  False   False    False     False
e  False  False   False     True     False

In [144]:
my_df.notnull() # used for checking missing values, check whether value is not null or not, False on e's college

   name   age  Degree  College  Location
a  True  True    True     True      True
b  True  True    True     True      True
c  True  True    True     True      True
d  True  True    True     True      True
e  True  True    True    False      True

In [145]:
my_df.notna() # used for checking missing values

   name   age  Degree  College  Location
a  True  True    True     True      True
b  True  True    True     True      True
c  True  True    True     True      True
d  True  True    True     True      True
e  True  True    True    False      True

In [146]:
my_df.dropna() # Removes row with missing values, by default axis=0 --> rows

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad

In [147]:
my_df.dropna(axis=1) # On using axis=1 Removes column with missing values
# my_df.dropna(axis=1,inplace=True) # On using inplace=True changes are reflected in Original Dataframe too

                name  age                  Degree    Location
a  Uday Vikram Singh   20             B.Tech(CSE)     Lucknow
b      Anubhav Yadav   21        B.Tech(Chemical)     Lucknow
c      Prakhar Nigam   21  B.Tech(Cyber Security)  Chandigarh
d        Anand Kumar   23                  B.Arch   Ghaziabad
e        Ravi Mishra   21                 Nursing     Lucknow

In [148]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,None,Lucknow

In [149]:
my_df.fillna('Integral University',inplace=True) # replace missing values with specified values

In [150]:
my_df

,name,age,Degree,College,Location
a,Uday Vikram Singh,20,B.Tech(CSE),SRMCEM,Lucknow
b,Anubhav Yadav,21,B.Tech(Chemical),IET,Lucknow
c,Prakhar Nigam,21,B.Tech(Cyber Security),Chandigarh University,Chandigarh
d,Anand Kumar,23,B.Arch,SDCA,Ghaziabad
e,Ravi Mishra,21,Nursing,Integral University,Lucknow